"""
Создать еще одну переменную, равную среднему арифметическому возрасту ваших друзей и вывести это значение на экран.
"""

alex = 21
ben = 34
john = 56

arithmetic_mean_of_ages = (alex + ben + john) / 3
print(arithmetic_mean_of_ages)    # 37.0
