"""
Создать еще одну переменную равную среднему арифметическому возрасту ваших друзей и вывести это значение на экран.
"""

alex = 20
ben = 34
john = 55
result = (alex + ben + john) / 3
print(result)
