"""
Создать переменную содержащую сторону квадрата.
Создать новый список, в котором будут периметр квадрата, площадь квадрата и диагональ квадрата.
"""

import math

size = 3
list = [size * 4, size * size, math.sqrt(2) * size]
print(list)
