"""
Создать еще одну переменную равную среднему арифметическому возрасту, и вывести это значение на экран.
"""

result = (alex + ben + john) / 3
print(result)
