"""
Создать три переменные, содержащие возраст трех ваших друзей.
В качестве имен переменных использовать имена ваших друзей, найти сумму и вывести ее на экран.
"""

alex = 20
ben = 34
john = 55
print("Sum of age:", alex + ben + john)
