"""
Создать три переменные, содержащие возраст трех ваших друзей.
В качестве имен переменных использовать имена ваших друзей.
Необходимо найти сумму всех возрастов ваших друзей и вывести ее на экран.
"""

alex = 20
ben = 34
john = 55
print("Sum of ages:", alex + ben + john)
