"""
Создать три переменные, содержащие возраст трех ваших друзей.
В качестве имен переменных использовать имена друзей, найти сумму и вывести ее на экран.
"""

alex = 20
ben = 34
john = 55
print(alex + ben + john)
