"""
Создать три переменные, которые содержат возраст трех ваших друзей.
В качестве имен переменных использовать имена ваших друзей.
Необходимо найти сумму всех возрастов ваших друзей и вывести ее на экран.
"""

alex = 20
ben = 34
john = 55

sum_of_ages = alex + ben + john
print(sum_of_ages)
