"""
# 1:
Обновить функции (роуты) из домашнего задания, чтобы они принимали данные в виде JSON.
Функции принимают POST запросы и создают соответствующие объекты и записи в БД.

# 2:
Обновить для каждой модели функцию, которая по GET запросу отдает список объектов в базе в виде JSON.

# 3:
В отдельном файле написать программу, которая использует библиотеку requests.
При помощи этой библиотеки, программа делает GET запросы на роуты и проверяет наличие данных в ответе.

# 4:
Также создать функцию, которая делает POST запросы и проверяет статус код ответа с сервера.
"""
